#+TITLE: Project Plan Summary
#+AUTHOR: Martin Homuth
#+DATE: <2018-12-10 Mon>

Project: A Discipline for Software Engineering
Program: 1A
Language: C

|---+---------------------+------+--------+---------+-----------|
|   | Time in Phase (min) | Plan | Actual | To Date | To Date % |
|---+---------------------+------+--------+---------+-----------|
| # | Planning            |   20 |     11 |         |           |
| # | Design              |   40 |        |         |           |
| # | Code                |  120 |        |         |           |
| # | Compile             |   30 |        |         |           |
| # | Test                |   20 |        |         |           |
| # | Postmortem          |      |        |         |           |
| # | ..Total             |  230 |     11 |       0 |         0 |
|---+---------------------+------+--------+---------+-----------|
|   | Defects Injected    |      | Actual | To Date | To Date % |
|---+---------------------+------+--------+---------+-----------|
| # | Planning            |      |        |         |           |
| # | Design              |      |        |         |           |
| # | Code                |      |        |         |           |
| # | Compile             |      |        |         |           |
| # | Test                |      |        |         |           |
| # | ..Total Development |    0 |      0 |       0 |         0 |
|---+---------------------+------+--------+---------+-----------|
|   | Defects Removed     |      | Actual | To Date | To Date % |
|---+---------------------+------+--------+---------+-----------|
| # | Planning            |      |        |         |           |
| # | Design              |      |        |         |           |
| # | Code                |      |        |         |           |
| # | Compile             |      |        |         |           |
| # | Test                |      |        |         |           |
| # | ..Total Development |    0 |      0 |       0 |         0 |
| # | After Development   |      |        |         |           |
|---+---------------------+------+--------+---------+-----------|
#+TBLFM: @8$3..@8$6=vsum(@2..@7)::@15$3..@15$6=vsum(@10..@14)::@22$3..@22$6=vsum(@17..@21)
